;;; YY --- description -*- lexical-binding: t; -*-
;;
;; Copyright (C) YY YY
;;
;; Author: YY <http://github/YY>
;; Maintainer: YY <YY>
;; Created: YY
;; Modified: YY
;; Version: 0.0.1
;; Keywords:
;; Homepage: https://github.com/YY/YY
;; Package-Requires: ((emacs YY) (cl-lib "0.5"))
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:
;;
;;  
;;
;;; Code:

(package! org-projectile :pin "96a57a43555e24e5e0d81e79f0fbb47001c41bac")
(package! org-roam-server :pin "fde2636d794f020ed5810fa38fe57a264932f661")
(package! org-roam :pin "ac2044b84bb99e8a77e834043b4aa16b4b89d8fc")
(package! org-ref :pin "2a91b6f67dc3116b0b688c1242ce67d90d833326")
(package! org-roam-bibtex :pin "e82b63b9b8c6772274f7cc2e9496559dd2219b29")
(package! org-noter :pin "9ead81d42dd4dd5074782d239b2efddf9b8b7b3d")
(package! company-org-roam :pin "1132663bd68022aa7ea005ff53c7c7571890769d")
(package! org-super-agenda :pin "3264255989021b8563ea42b5d26acbc2a024f14d")

(provide 'packages)
;;; packages.el ends here
