;;; YY --- description -*- lexical-binding: t; -*-
;;
;; Copyright (C) YY YY
;;
;; Author: YY <http://github/YY>
;; Maintainer: YY <YY>
;; Created: YY
;; Modified: YY
;; Version: 0.0.1
;; Keywords:
;; Homepage: https://github.com/YY/YY
;; Package-Requires: ((emacs YY) (cl-lib "0.5"))
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:
;;
;;  
;;
;;; Code:

(package! org-projectile)
(package! org-roam-server)
(package! org-roam)
(package! org-ref)
(package! org-roam-bibtex)
(package! org-noter)
(package! company-org-roam)
(package! org-super-agenda)

(provide 'packages)
;;; packages.el ends here
