;; -*- no-byte-compile: t; -*-
;; .doom.d/packages.el

(package! linum-relative)
(package! org-alert)
(package! undo-tree)
(package! evil-snipe)
(package! darkroom) ;; better writeroom, for now
(package! focus) ;; focuses on current line

(package! deadgrep)
(package! quelpa)
(package! quelpa-use-package)
(package! anki-editor)

(package! org-tanglesync)
(package! org-chef)
(package! spray)
(package! tramp)

(package! flyspell-lazy)
(package! wttrin)
(package! org-msg)
(package! mu4e-alert)

;; async package installation
(package! el-get)
(package! use-package-el-get)
